import React from 'react';
import { HiOutlineViewGrid } from 'react-icons/hi';
import { CiStar } from 'react-icons/ci';
import { PiStarBold } from 'react-icons/pi';
import { GrCart } from 'react-icons/gr';
import { GiStack } from 'react-icons/gi';
import { IoSearch } from 'react-icons/io5';

import { TbAirConditioning } from 'react-icons/tb';
import { MdOutlineHvac } from 'react-icons/md';
import { MdOutlineWbSunny } from 'react-icons/md';

import { BsTools } from 'react-icons/bs';
import { CiShoppingCart } from 'react-icons/ci';
import { FiShoppingCart } from 'react-icons/fi';

import hvac_family from '../assets/images/family_hvac.png';
import split_systems from '../assets/images/split_systems.jpg';

import daikin_img from '../assets/images/daikin_label.png';
import lessar_img from '../assets/images/lessar_label.png';
import lg_img from '../assets/images/lg_label.png';
import royalcli_img from '../assets/images/royal_clima_label.png';

import bg1 from '../assets/images/bg_1.jpg';
import bg2 from '../assets/images/bg_2.jpg';
import bg_proj from '../assets/images/bg-3.png';
import bg_hvac from '../assets/images/bg-4.png';

import split_sys1 from '../assets/images/split_sys_1.png';

import project_img from '../assets/images/project.png';

import big_screen_img1 from '../assets/images/big_screen_img1.jpg';

import visa_img from '../assets/images/visa_img.png';
import mir_img from '../assets/images/mir_img.png';
import mastercard from '../assets/images/mastercard_img.png';

const App = () => {
  return (
    <>
      <header className="flex justify-between lg:flex-col">
        {/* ------------ ХЕАДЕР: ПЕРВЫЙ РЯД ---------------- */}
        {/* ------------ ХЕАДЕР: ПЕРВЫЙ РЯД ---------------- */}
        {/* ------------ ХЕАДЕР: ПЕРВЫЙ РЯД ---------------- */}
        <div className="lg:flex items-center justify-between p-4 border-b-1 border-[rgba(114,114,114,0.2)] lg:px-8 xl:px-14 hidden">
          <div className="flex gap-10">
            <p className=" text-[15px] text-[#232323]">
              г. Санкт-Петербург, пр-т Наставников, 40
            </p>
            <p className="text-[15px] text-[#6E6E6E]">Пн-Пт 09:00-18:00</p>
          </div>
          <nav>
            <ul className="flex gap-3 font-[600] text-[#1B9AE9]">
              <li className="p-1 cursor-pointer">О компании</li>
              <li className="p-1 cursor-pointer">Акции и скидки</li>
              <li className="flex items-center gap-1 cursor-pointer">
                Сервис
                <div>
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    fill="none"
                    viewBox="0 0 24 24"
                    strokeWidth="1.5"
                    stroke="currentColor"
                    className="mt-[3px] size-4"
                  >
                    <path
                      strokeLinecap="round"
                      strokeLinejoin="round"
                      d="m19.5 8.25-7.5 7.5-7.5-7.5"
                    />
                  </svg>
                </div>
              </li>
              <li className="p-1 cursor-pointer">Контакты</li>
            </ul>
          </nav>
        </div>

        {/* ------------ ХЕАДЕР: ВТОРОЙ РЯД ---------------- */}
        {/* ------------ ХЕАДЕР: ВТОРОЙ РЯД ---------------- */}
        {/* ------------ ХЕАДЕР: ВТОРОЙ РЯД ---------------- */}
        <div className="w-full flex justify-between gap-5 p-3 border-b-1 border-b-[rgba(114,114,114,0.2)] lg:px-8 xl:px-14">
          <div className="flex items-center">
            <span className="text-[25px]">Soft</span>
            <span className="text-[25px] text-[#3b9dca]">Vent</span>
          </div>
          <button className="lg:hidden cursor-pointer">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              fill="none"
              viewBox="0 0 24 24"
              strokeWidth={1.5}
              stroke="currentColor"
              className="size-6 text-[#3b9dca]"
            >
              <path
                strokeLinecap="round"
                strokeLinejoin="round"
                d="M3.75 6.75h16.5M3.75 12h16.5M12 17.25h8.25"
              />
            </svg>
          </button>

          <div className="w-[100%] gap-4 justify-between lg:flex hidden">
            <div className="w-[30%] flex items-center gap-3">
              <button className="p-2 rounded-md bg-[#1B9AE9] cursor-pointer">
                <HiOutlineViewGrid className="text-[25px] text-[whitesmoke]" />
              </button>
              <div className="w-[100%] max-w-[365px] flex items-center bg-gray-200 rounded-md pr-2">
                <input
                  className="w-[100%] p-2 outline-none"
                  placeholder="Поиск"
                />
                <div className="cursor-pointer">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    fill="none"
                    viewBox="0 0 24 24"
                    strokeWidth="1.5"
                    stroke="currentColor"
                    className="size-5 text-gray-500"
                  >
                    <path
                      strokeLinecap="round"
                      strokeLinejoin="round"
                      d="m21 21-5.197-5.197m0 0A7.5 7.5 0 1 0 5.196 5.196a7.5 7.5 0 0 0 10.607 10.607Z"
                    />
                  </svg>
                </div>
              </div>
            </div>

            <div className="flex gap-5 items-end">
              <div className="flex flex-col gap-1 items-center text-nowrap">
                <p className="text-center text-[14px] font-[600] leading-[16px]">
                  +7 (981) 755-47-56
                </p>
                <p className="text-center text-[14px] leading-[16px] text-[#6E6E6E]">
                  vb415@bk.ru
                </p>
              </div>

              <div className="flex flex-col gap-1 items-center text-nowrap">
                <p className="text-center text-[14px] font-[600] leading-[16px]">
                  +7 (981) 755-47-56
                </p>
                <button className="flex items-center gap-2 text-[14px] leading-[16px] cursor-pointer">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    fill="none"
                    viewBox="0 0 24 24"
                    strokeWidth={1.5}
                    stroke="currentColor"
                    className="size-4 text-[#6E6E6E]"
                  >
                    <path
                      strokeLinecap="round"
                      strokeLinejoin="round"
                      d="M2.25 6.75c0 8.284 6.716 15 15 15h2.25a2.25 2.25 0 0 0 2.25-2.25v-1.372c0-.516-.351-.966-.852-1.091l-4.423-1.106c-.44-.11-.902.055-1.173.417l-.97 1.293c-.282.376-.769.542-1.21.38a12.035 12.035 0 0 1-7.143-7.143c-.162-.441.004-.928.38-1.21l1.293-.97c.363-.271.527-.734.417-1.173L6.963 3.102a1.125 1.125 0 0 0-1.091-.852H4.5A2.25 2.25 0 0 0 2.25 4.5v2.25Z"
                    />
                  </svg>
                  <span className="text-left underline decoration-dotted text-[#6E6E6E]">
                    Заказать обратный звонок
                  </span>
                </button>
              </div>
            </div>

            <ul className="flex gap-3">
              <li className="flex flex-col items-center">
                <a className="flex flex-col items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
                  <GiStack className="text-[26px]" />
                  Сравнение
                </a>
              </li>
              <li className="flex flex-col items-center">
                <a className="flex flex-col items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
                  <PiStarBold className="text-[26px]" />
                  <span>Избранное</span>
                </a>
              </li>
              <li className="flex flex-col items-center">
                <a className="flex flex-col items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
                  <FiShoppingCart className="text-[26px]" />
                  <span>Корзина</span>
                </a>
              </li>
            </ul>
          </div>
        </div>

        {/* ------------ ХЕАДЕР: ТРЕТИЙ РЯД ---------------- */}
        {/* ------------ ХЕАДЕР: ТРЕТИЙ РЯД ---------------- */}
        {/* ------------ ХЕАДЕР: ТРЕТИЙ РЯД ---------------- */}
        <nav>
          <ul className="p-3 lg:flex items-center gap-15 justify-center hidden">
            <li className="text-[#6E6E6E] flex items-center gap-1 cursor-pointer">
              <TbAirConditioning className="text-[#1B9AE9] mt-1 text-[25px] opacity-50" />
              Кондиционеры{' '}
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth="1.5"
                stroke="currentColor"
                className="mt-[3px] size-4"
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="m19.5 8.25-7.5 7.5-7.5-7.5"
                />
              </svg>
            </li>
            <li className="text-[#6E6E6E] flex items-center gap-1 cursor-pointer">
              <MdOutlineHvac className="text-[#1B9AE9] mt-0.5 text-[25px] opacity-50" />
              Вентиляция{' '}
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth="1.5"
                stroke="currentColor"
                className="mt-[3px] size-4"
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="m19.5 8.25-7.5 7.5-7.5-7.5"
                />
              </svg>
            </li>
            <li className="text-[#6E6E6E] flex items-center gap-1 cursor-pointer">
              <MdOutlineWbSunny className="text-[#1B9AE9] mt-1 text-[25px] opacity-50" />
              Домашний микроклимат{' '}
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth="1.5"
                stroke="currentColor"
                className="mt-[3px] size-4"
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="m19.5 8.25-7.5 7.5-7.5-7.5"
                />
              </svg>
            </li>
          </ul>
        </nav>
      </header>
      {/* --------------------------------------------------- MAIN: -------------------------------------------------------------- */}
      {/* --------------------------------------------------- MAIN: -------------------------------------------------------------- */}
      {/* --------------------------------------------------- MAIN: -------------------------------------------------------------- */}
      <main className="mt-4">
        {/* УСЛУГИ КОМПАНИИ И КАТАЛОГ: */}
        <section className="flex flex-col gap-4 px-3 xs:px-8 lg:flex-row xl:px-14">
          <div className="relative lg:min-w-[500px]">
            <div className="h-full w-[70%] max-w-[400px] absolute top-0 left-0 rounded-tl-2xl rounded-bl-2xl bg-gray-200 opacity-60 services-layer"></div>
            <div className="w-[50%] max-w-[400px] flex flex-col absolute left-4 top-4">
              <span className="text-[12px] font-[500] text-[#6E6E6E] mb-2 xs:text-[14px] sm:text-[18px]">
                Настенные кондиционеры
              </span>
              <p className="text-[18px] text-[#232323] font-[600] leading-6 mb-2 sm:text-[22px]">
                Создайте себе комфорт!
              </p>
              <p className="mb-1 text-[12px] xs:text-[14px] sm:text-[18px]">
                Широкий выбор систем кондиционирования с гарантией от
                производителя
              </p>
              <a
                href="#"
                className="w-fit h-full mt-2 p-2 bg-gradient-to-r from-blue-400 to-blue-500 rounded-md text-[whitesmoke] font-[500] xs:mt-6 sm:mt-8 sm:text-[18px]"
              >
                Каталог
              </a>
            </div>
            <div className="rounded-2xl">
              <img
                className="rounded-2xl w-[100%] lg:min-h-[440px]"
                src={hvac_family}
                alt="семья настраивает кондиционер"
              ></img>
            </div>
          </div>

          <div className="flex flex-col gap-2 lg:justify-between">
            <ul className="flex gap-2 xl:flex-col">
              <li className="min-h-[105px] relative flex flex-col gap-2 p-3 bg-gray-200 rounded-2xl">
                <h3 className="text-[14px] font-[500] leading-[14px] z-10 lg:leading-[18px] xl:text-[18px]">
                  <span>Выезд и замеры от инженера - </span>
                  <span className="text-[#1b9ae9]">Бесплатно</span>
                </h3>
                <p className="text-[12px] leading-[12px] z-10 xs:text-[14px] lg:leading-[18px] xl:text-[16px]">
                  Произведём замеры, расскажем о ходе работ и договоримся о
                  сроках
                </p>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  fill="none"
                  viewBox="0 0 24 24"
                  strokeWidth={1.5}
                  stroke="currentColor"
                  className="size-26 text-gray-300 absolute top-0 left-0 z-0 opacity-70"
                >
                  <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="M8.25 18.75a1.5 1.5 0 0 1-3 0m3 0a1.5 1.5 0 0 0-3 0m3 0h6m-9 0H3.375a1.125 1.125 0 0 1-1.125-1.125V14.25m17.25 4.5a1.5 1.5 0 0 1-3 0m3 0a1.5 1.5 0 0 0-3 0m3 0h1.125c.621 0 1.129-.504 1.09-1.124a17.902 17.902 0 0 0-3.213-9.193 2.056 2.056 0 0 0-1.58-.86H14.25M16.5 18.75h-2.25m0-11.177v-.958c0-.568-.422-1.048-.987-1.106a48.554 48.554 0 0 0-10.026 0 1.106 1.106 0 0 0-.987 1.106v7.635m12-6.677v6.677m0 4.5v-4.5m0 0h-12"
                  />
                </svg>
              </li>
              <li className="min-h-[105px] relative flex flex-col gap-2 p-3 bg-blue-200 rounded-2xl">
                <h3 className="text-[14px] font-[500] leading-[12px] z-10 lg:leading-[18px] xl:text-[18px]">
                  Подготовка проекта и сметы
                </h3>
                <p className="text-[12px] leading-[12px] z-10 xs:text-[14px] lg:leading-[18px] xl:text-[16px]">
                  Бесплатный подбор и расчет стоимости оборудования, монтажных
                  работ
                </p>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  fill="none"
                  viewBox="0 0 24 24"
                  strokeWidth={1.5}
                  stroke="currentColor"
                  className="size-26 text-blue-300 absolute top-0 left-0 z-0 opacity-50"
                >
                  <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="M15.75 15.75V18m-7.5-6.75h.008v.008H8.25v-.008Zm0 2.25h.008v.008H8.25V13.5Zm0 2.25h.008v.008H8.25v-.008Zm0 2.25h.008v.008H8.25V18Zm2.498-6.75h.007v.008h-.007v-.008Zm0 2.25h.007v.008h-.007V13.5Zm0 2.25h.007v.008h-.007v-.008Zm0 2.25h.007v.008h-.007V18Zm2.504-6.75h.008v.008h-.008v-.008Zm0 2.25h.008v.008h-.008V13.5Zm0 2.25h.008v.008h-.008v-.008Zm0 2.25h.008v.008h-.008V18Zm2.498-6.75h.008v.008h-.008v-.008Zm0 2.25h.008v.008h-.008V13.5ZM8.25 6h7.5v2.25h-7.5V6ZM12 2.25c-1.892 0-3.758.11-5.593.322C5.307 2.7 4.5 3.65 4.5 4.757V19.5a2.25 2.25 0 0 0 2.25 2.25h10.5a2.25 2.25 0 0 0 2.25-2.25V4.757c0-1.108-.806-2.057-1.907-2.185A48.507 48.507 0 0 0 12 2.25Z"
                  />
                </svg>
              </li>
            </ul>

            <ul className="flex flex-col gap-2 justify-between xs:flex-row lg:flex-col lg:justify-end">
              <li className="min-w-[115px] min-h-[105px] flex flex-col relative gap-2 p-3 bg-gray-100 rounded-2xl sm:min-w-[145px] lg:min-h-0">
                <h3 className="text-[14px] font-[500] leading-[12px] z-10 lg:leading-[18px] xl:text-[18px]">
                  Сервисное обслуживание
                </h3>

                <p className="text-[12px] leading-[12px] z-10 xs:text-[14px] lg:leading-[18px] xl:text-[16px]">
                  Продлим срок работы вашей технике
                </p>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  fill="none"
                  viewBox="0 0 24 24"
                  strokeWidth={1.5}
                  stroke="currentColor"
                  className="size-26 text-gray-200 absolute top-0 left-0 z-0 opacity-70 lg:size-17"
                >
                  <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="M9.594 3.94c.09-.542.56-.94 1.11-.94h2.593c.55 0 1.02.398 1.11.94l.213 1.281c.063.374.313.686.645.87.074.04.147.083.22.127.325.196.72.257 1.075.124l1.217-.456a1.125 1.125 0 0 1 1.37.49l1.296 2.247a1.125 1.125 0 0 1-.26 1.431l-1.003.827c-.293.241-.438.613-.43.992a7.723 7.723 0 0 1 0 .255c-.008.378.137.75.43.991l1.004.827c.424.35.534.955.26 1.43l-1.298 2.247a1.125 1.125 0 0 1-1.369.491l-1.217-.456c-.355-.133-.75-.072-1.076.124a6.47 6.47 0 0 1-.22.128c-.331.183-.581.495-.644.869l-.213 1.281c-.09.543-.56.94-1.11.94h-2.594c-.55 0-1.019-.398-1.11-.94l-.213-1.281c-.062-.374-.312-.686-.644-.87a6.52 6.52 0 0 1-.22-.127c-.325-.196-.72-.257-1.076-.124l-1.217.456a1.125 1.125 0 0 1-1.369-.49l-1.297-2.247a1.125 1.125 0 0 1 .26-1.431l1.004-.827c.292-.24.437-.613.43-.991a6.932 6.932 0 0 1 0-.255c.007-.38-.138-.751-.43-.992l-1.004-.827a1.125 1.125 0 0 1-.26-1.43l1.297-2.247a1.125 1.125 0 0 1 1.37-.491l1.216.456c.356.133.751.072 1.076-.124.072-.044.146-.086.22-.128.332-.183.582-.495.644-.869l.214-1.28Z"
                  />
                  <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="M15 12a3 3 0 1 1-6 0 3 3 0 0 1 6 0Z"
                  />
                </svg>
              </li>
              <li className="min-w-[115px] min-h-[105px] flex flex-col relative gap-2 p-3 bg-blue-200 rounded-2xl lg:min-h-0">
                <h3 className="text-[14px] font-[500] leading-[12px] z-10 lg:leading-[18px] xl:text-[18px]">
                  Монтаж за 1 день
                </h3>
                <p className="text-[12px] leading-[12px] z-10 xs:text-[14px] lg:leading-[18px] xl:text-[16px]">
                  Установка и настройка климатического оборудования от 3-х часов
                </p>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  fill="none"
                  viewBox="0 0 24 24"
                  strokeWidth={1.5}
                  stroke="currentColor"
                  className="size-26 text-blue-300 absolute top-0 left-0 z-0 opacity-30 lg:size-17"
                >
                  <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="M11.42 15.17 17.25 21A2.652 2.652 0 0 0 21 17.25l-5.877-5.877M11.42 15.17l2.496-3.03c.317-.384.74-.626 1.208-.766M11.42 15.17l-4.655 5.653a2.548 2.548 0 1 1-3.586-3.586l6.837-5.63m5.108-.233c.55-.164 1.163-.188 1.743-.14a4.5 4.5 0 0 0 4.486-6.336l-3.276 3.277a3.004 3.004 0 0 1-2.25-2.25l3.276-3.276a4.5 4.5 0 0 0-6.336 4.486c.091 1.076-.071 2.264-.904 2.95l-.102.085m-1.745 1.437L5.909 7.5H4.5L2.25 3.75l1.5-1.5L7.5 4.5v1.409l4.26 4.26m-1.745 1.437 1.745-1.437m6.615 8.206L15.75 15.75M4.867 19.125h.008v.008h-.008v-.008Z"
                  />
                </svg>
              </li>
              <li className="min-w-[115px] min-h-[105px] flex flex-col relative gap-2 p-3 bg-orange-100 rounded-2xl lg:min-h-0">
                <h3 className="text-[14px] font-[500] leading-[12px] z-10 lg:leading-[18px] xl:text-[18px]">
                  Ежемесячные скидки
                </h3>
                <p className="text-[12px] leading-[12px] z-10 xs:text-[14px] lg:leading-[18px] xl:text-[16px]">
                  Большой ассортимент оборудования в наличии на складе
                </p>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  fill="none"
                  viewBox="0 0 24 24"
                  strokeWidth={1.5}
                  stroke="currentColor"
                  className="size-26 absolute text-orange-200 top-0 left-0 z-0 opacity-40 lg:size-17"
                >
                  <path
                    strokeLinecap="round"
                    strokeLinejoin="round"
                    d="m8.99 14.993 6-6m6 3.001c0 1.268-.63 2.39-1.593 3.069a3.746 3.746 0 0 1-1.043 3.296 3.745 3.745 0 0 1-3.296 1.043 3.745 3.745 0 0 1-3.068 1.593c-1.268 0-2.39-.63-3.068-1.593a3.745 3.745 0 0 1-3.296-1.043 3.746 3.746 0 0 1-1.043-3.297 3.746 3.746 0 0 1-1.593-3.068c0-1.268.63-2.39 1.593-3.068a3.746 3.746 0 0 1 1.043-3.297 3.745 3.745 0 0 1 3.296-1.042 3.745 3.745 0 0 1 3.068-1.594c1.268 0 2.39.63 3.068 1.593a3.745 3.745 0 0 1 3.296 1.043 3.746 3.746 0 0 1 1.043 3.297 3.746 3.746 0 0 1 1.593 3.068ZM9.74 9.743h.008v.007H9.74v-.007Zm.375 0a.375.375 0 1 1-.75 0 .375.375 0 0 1 .75 0Zm4.125 4.5h.008v.008h-.008v-.008Zm.375 0a.375.375 0 1 1-.75 0 .375.375 0 0 1 .75 0Z"
                  />
                </svg>
              </li>
            </ul>
          </div>
        </section>

        {/* ДОПОЛНИТЕЛЬНЫЕ УСЛУГИ КОМПАНИИ (ДЕТАЛИ) И КАТАЛОГ: */}
        <ul className="lg:flex gap-4 px-8 mt-8 hidden">
          <li className="flex flex-col gap-4">
            <div className="flex gap-3 items-center">
              <div className="p-2 bg-gray-100 rounded-md">
                <svg
                  width="34"
                  height="33"
                  viewBox="0 0 34 33"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M1.34737 27.9609L16.8374 31.9729C16.8914 31.9879 16.9454 31.9939 17.0004 31.9939C17.0554 31.9939 17.1094 31.9869 17.1634 31.9729L32.6534 27.9609C32.9404 27.8869 33.1404 27.6279 33.1404 27.3319V5.80191C33.1404 5.78691 33.1314 5.77391 33.1304 5.75891C33.1264 5.69691 33.1104 5.63891 33.0884 5.58091C33.0784 5.55291 33.0734 5.52491 33.0594 5.49791C32.9764 5.34291 32.8364 5.21991 32.6524 5.17191L32.6244 5.16491C32.6214 5.16391 32.6194 5.16391 32.6164 5.16291L17.1624 1.16091C17.1524 1.15791 17.1434 1.16091 17.1334 1.15891C17.0894 1.14991 17.0444 1.15091 16.9984 1.15091C16.9534 1.15091 16.9104 1.14991 16.8674 1.15891C16.8574 1.16091 16.8464 1.15791 16.8364 1.16091L1.38137 5.16391C1.37937 5.16391 1.37638 5.16491 1.37638 5.16491L1.34737 5.17291C1.16337 5.21991 1.02337 5.34391 0.940374 5.49891C0.926374 5.52491 0.921375 5.55391 0.911375 5.58191C0.890375 5.63991 0.874375 5.69691 0.869375 5.75991C0.868375 5.77491 0.859375 5.78791 0.859375 5.80291V27.3329C0.859375 27.6279 1.06037 27.8869 1.34737 27.9609ZM17.0004 2.46091L22.1544 3.79591L9.25537 7.13691L4.10137 5.80191L17.0004 2.46091ZM29.8994 5.80191L17.0004 9.14191L11.8464 7.80691L24.7454 4.46591L29.8994 5.80191ZM2.16037 6.64191L8.60437 8.31091V16.6089C8.60437 16.9679 8.89537 17.2589 9.25437 17.2589C9.61337 17.2589 9.90437 16.9679 9.90437 16.6089V8.64791L16.3484 10.3169V30.5049L2.16037 26.8289V6.64191ZM31.8404 26.8289L17.6504 30.5039V10.3159L31.8394 6.64091L31.8404 26.8289Z"
                    fill="#6E6E6E"
                  ></path>
                  <path
                    d="M23.8638 16.3338C23.8098 16.3478 23.7558 16.3548 23.7008 16.3548C23.5588 16.3548 23.4178 16.3088 23.3028 16.2188C23.1438 16.0958 23.0498 15.9058 23.0498 15.7048V11.9668C23.0498 11.6708 23.2498 11.4118 23.5368 11.3378L29.3608 9.82884C29.5538 9.77484 29.7638 9.81884 29.9218 9.94384C30.0808 10.0668 30.1748 10.2568 30.1748 10.4578V14.1968C30.1748 14.4928 29.9738 14.7518 29.6878 14.8258L23.8638 16.3338Z"
                    fill="#1B9AE9"
                  ></path>
                </svg>
              </div>
              <h5 className="text-[16px] font-[600] text-[#232323]">
                Бесплатная доставка
              </h5>
            </div>
            <p className="text-[#232323] leading-[20px]">
              Бережно доставляем любой заказ по Санкт-Петербургу, а также
              транспортными компаниями в любой город.
            </p>
          </li>

          <li className="flex flex-col gap-4">
            <div className="flex gap-3 items-center">
              <div className="p-2 bg-gray-100 rounded-md">
                <svg
                  width="37"
                  height="33"
                  viewBox="0 0 37 33"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M26.6727 12.8145V23.4473C26.6727 23.7957 26.9552 24.0781 27.3036 24.0781H29.6476H29.9805C33.2601 24.0781 35.9283 21.41 35.9283 18.1304C35.9283 14.9313 33.3873 12.3214 30.2183 12.1952C29.6185 6.22611 24.5656 1.55078 18.4412 1.55078C12.3168 1.55078 7.26389 6.22708 6.6631 12.1962C3.49412 12.3224 0.953125 14.9323 0.953125 18.1313C0.953125 21.3663 3.55139 24.0015 6.76986 24.0723C6.93389 24.9924 7.2503 26.0164 7.85983 26.7667C9.02065 28.1944 11.2977 29.6775 13.7076 29.7988C14.0415 30.7558 14.9432 31.4488 16.0128 31.4488C17.3648 31.4488 18.4635 30.3481 18.4635 28.9971C18.4635 27.646 17.3638 26.5463 16.0128 26.5463C14.8209 26.5463 13.828 27.4014 13.6086 28.5302C11.7189 28.372 9.82527 27.186 8.83915 25.9718C8.42957 25.468 8.19177 24.7624 8.05201 24.0801H9.5768C9.92524 24.0801 10.2077 23.7976 10.2077 23.4492V12.8145C10.2077 12.466 9.92524 12.1836 9.5768 12.1836H7.93942C8.54118 6.91813 13.0175 2.81352 18.4412 2.81352C23.8648 2.81352 28.3422 6.91813 28.9429 12.1836H27.3046C26.9552 12.1836 26.6727 12.466 26.6727 12.8145ZM16.0137 27.8081C16.6699 27.8081 17.2027 28.341 17.2027 28.9971C17.2027 29.6532 16.6699 30.187 16.0137 30.187C15.3576 30.187 14.8248 29.6532 14.8248 28.9971C14.8248 28.341 15.3576 27.8081 16.0137 27.8081ZM2.21586 18.1313C2.21586 15.6476 4.15801 13.6094 6.60292 13.455V21.8681C6.60098 21.9312 6.59613 22.1098 6.60292 22.3738V22.73V22.8086C4.15801 22.6533 2.21586 20.6141 2.21586 18.1313ZM8.94689 22.8164H7.88701C7.87536 22.6465 7.86857 22.4932 7.86565 22.3621V13.4463H8.94689V22.8164ZM34.6665 18.1313C34.6665 20.6151 32.7244 22.6533 30.2794 22.8076V22.729V13.4541C32.7244 13.6084 34.6665 15.6476 34.6665 18.1313ZM27.9355 13.4463H29.0167V22.729V22.8164H27.9355V13.4463Z"
                    fill="#6E6E6E"
                  ></path>
                  <circle cx="16" cy="29" r="2" fill="#1B9AE9"></circle>
                </svg>
              </div>
              <h5 className="text-[16px] font-[600] text-[#232323]">
                Бесплатная консультация
              </h5>
            </div>
            <p className="text-[#232323] leading-[20px]">
              Уточним площадь помещения. Поможем с выбором необходимой
              климатической техники. Сориентируем по цене.
            </p>
          </li>

          <li className="flex flex-col gap-4">
            <div className="flex gap-3 items-center">
              <div className="p-2 bg-gray-100 rounded-md">
                <svg
                  width="33"
                  height="33"
                  viewBox="0 0 33 33"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clipPath="url(#clip0_60_2335)">
                    <rect
                      x="20.7988"
                      y="24.4844"
                      width="5.11418"
                      height="11.5517"
                      transform="rotate(-45 20.7988 24.4844)"
                      fill="#1B9AE9"
                    ></rect>
                    <path
                      d="M25.2673 20.8783C25.0177 20.6425 24.6984 20.4939 24.3572 20.4549C24.0161 20.4158 23.6714 20.4884 23.375 20.6617L22.8594 18.5683V18.5219V18.4807C22.8341 18.4251 22.7992 18.3745 22.7562 18.3311L22.0292 17.6041C21.8855 17.4599 21.7147 17.3455 21.5267 17.2674C21.3387 17.1893 21.1371 17.1491 20.9335 17.1491C20.7299 17.1491 20.5283 17.1893 20.3403 17.2674C20.1523 17.3455 19.9815 17.4599 19.8378 17.6041L19.4717 17.2328L26.2986 10.3389C26.3586 10.2795 26.4323 10.2357 26.5132 10.2114C26.5942 10.1871 26.6798 10.1831 26.7626 10.1997C27.5483 10.369 28.363 10.3495 29.1397 10.143C30.0206 9.90551 30.8238 9.44099 31.4689 8.79584C32.1141 8.15069 32.5786 7.34752 32.8161 6.46659C32.98 5.85351 33.0272 5.21508 32.9553 4.58456C32.9333 4.39059 32.8567 4.20686 32.7344 4.05471C32.6121 3.90256 32.4491 3.78825 32.2644 3.72506C32.0797 3.66188 31.8809 3.65241 31.691 3.69777C31.5012 3.74312 31.3281 3.84143 31.1919 3.98128L29.7584 5.44565C29.7105 5.49398 29.6535 5.53234 29.5906 5.55852C29.5278 5.58469 29.4604 5.59817 29.3923 5.59817C29.3243 5.59817 29.2569 5.58469 29.194 5.55852C29.1312 5.53234 29.0742 5.49398 29.0262 5.44565L27.5825 3.98643C27.5334 3.93703 27.4949 3.87822 27.4692 3.81352C27.4435 3.74883 27.4312 3.67961 27.433 3.61003C27.4326 3.54094 27.446 3.47247 27.4726 3.4087C27.4992 3.34492 27.5383 3.28714 27.5876 3.23878L29.0262 1.7744C29.1637 1.6367 29.2594 1.46292 29.3023 1.27314C29.3452 1.08336 29.3335 0.885324 29.2686 0.7019C29.2029 0.522261 29.0885 0.364432 28.9383 0.246057C28.788 0.127682 28.6078 0.0534251 28.4178 0.0315877C27.1869 -0.105268 25.9478 0.205498 24.9272 0.907065C23.9066 1.60863 23.1725 2.65412 22.8594 3.85237C22.6527 4.62732 22.6332 5.4403 22.8026 6.22424C22.8253 6.30729 22.8267 6.39468 22.8069 6.47844C22.7871 6.5622 22.7466 6.63966 22.6892 6.70377L15.7747 13.5822L7.33905 5.1569L7.07092 3.79565C7.01177 3.49492 6.8646 3.21854 6.64811 3.00159L3.95139 0.304869C3.85562 0.208987 3.74188 0.132923 3.61669 0.0810262C3.4915 0.0291292 3.35731 0.00241713 3.22178 0.00241713C3.08626 0.00241713 2.95207 0.0291292 2.82688 0.0810262C2.70168 0.132923 2.58795 0.208987 2.49217 0.304869L0.305924 2.49112C0.210042 2.58689 0.133978 2.70063 0.0820813 2.82582C0.0301844 2.95101 0.00347231 3.08521 0.00347231 3.22073C0.00347231 3.35625 0.0301844 3.49044 0.0820813 3.61564C0.133978 3.74083 0.210042 3.85456 0.305924 3.95034L2.99749 6.64706C3.21444 6.86355 3.49082 7.01071 3.79155 7.06987L5.1528 7.33799L13.5833 15.7736L6.70483 22.6882C6.6448 22.7476 6.57109 22.7914 6.49017 22.8157C6.40925 22.8399 6.32361 22.844 6.24077 22.8274C5.45508 22.6581 4.64046 22.6776 3.86374 22.8841C2.98304 23.117 2.17874 23.5766 1.53098 24.2171C0.883216 24.8576 0.414614 25.6567 0.171862 26.5347C0.00792509 27.1478 -0.0393012 27.7862 0.0326429 28.4167C0.0557782 28.6086 0.132332 28.79 0.253581 28.9404C0.374829 29.0909 0.535896 29.2042 0.718424 29.2675C0.903017 29.3328 1.10239 29.3442 1.29323 29.3004C1.48406 29.2566 1.65848 29.1593 1.79608 29.02L3.22952 27.5557C3.27745 27.5073 3.33448 27.469 3.39731 27.4428C3.46015 27.4166 3.52754 27.4031 3.59561 27.4031C3.66368 27.4031 3.73108 27.4166 3.79391 27.4428C3.85674 27.469 3.91377 27.5073 3.96171 27.5557L5.42092 29.0149C5.51618 29.1109 5.56989 29.2405 5.57046 29.3758C5.57086 29.4449 5.55737 29.5134 5.5308 29.5771C5.50423 29.6409 5.46511 29.6987 5.41577 29.7471L3.97717 31.2114C3.83876 31.3482 3.74185 31.5213 3.69765 31.7108C3.65345 31.9003 3.66376 32.0984 3.72739 32.2823C3.79102 32.4662 3.90537 32.6283 4.05724 32.7499C4.2091 32.8716 4.39228 32.9478 4.58561 32.9697C4.7757 32.9903 4.96676 33.0006 5.15796 33.0006C6.29792 33.0001 7.40558 32.6218 8.30773 31.9249C9.20987 31.228 9.85564 30.2518 10.144 29.1489C10.3507 28.374 10.3702 27.561 10.2008 26.7771C10.1782 26.694 10.1767 26.6066 10.1965 26.5229C10.2163 26.4391 10.2568 26.3616 10.3142 26.2975L17.2287 19.4191L17.6 19.7852C17.4558 19.9289 17.3414 20.0997 17.2633 20.2877C17.1852 20.4757 17.145 20.6773 17.145 20.8809C17.145 21.0845 17.1852 21.2861 17.2633 21.4741C17.3414 21.6621 17.4558 21.8329 17.6 21.9766L18.327 22.6882C18.3704 22.7311 18.421 22.766 18.4765 22.7913H18.5178H18.5642L20.6525 23.3069C20.4564 23.6089 20.3717 23.9698 20.4131 24.3274C20.4545 24.6851 20.6194 25.0171 20.8794 25.2663L28.1755 32.5469C28.4655 32.8366 28.8587 32.9993 29.2686 32.9993C29.6785 32.9993 30.0717 32.8366 30.3617 32.5469L32.548 30.3607C32.8376 30.0706 33.0003 29.6774 33.0003 29.2675C33.0003 28.8576 32.8376 28.4644 32.548 28.1744L25.2673 20.8783ZM23.3956 7.41534C23.5764 7.23367 23.7092 7.00993 23.7821 6.76422C23.855 6.51852 23.8657 6.25855 23.8133 6.00768C23.6799 5.38572 23.694 4.74117 23.8545 4.12565C24.0432 3.41578 24.4164 2.76849 24.9362 2.24956C25.4561 1.73063 26.104 1.35855 26.8142 1.17112C27.3026 1.03807 27.8122 1.0013 28.3147 1.06284L26.8555 2.52721C26.7112 2.67092 26.5968 2.84169 26.5187 3.02971C26.4407 3.21774 26.4005 3.41933 26.4005 3.62292C26.4005 3.82651 26.4407 4.02809 26.5187 4.21612C26.5968 4.40415 26.7112 4.57491 26.8555 4.71862L28.3147 6.18815C28.4584 6.33236 28.6291 6.44678 28.8172 6.52486C29.0052 6.60293 29.2068 6.64312 29.4104 6.64312C29.614 6.64312 29.8156 6.60293 30.0036 6.52486C30.1916 6.44678 30.3624 6.33236 30.5061 6.18815L31.9705 4.69799C32.0173 5.19905 31.9701 5.70445 31.8312 6.18815C31.6415 6.89245 31.2702 7.5346 30.7544 8.05037C30.2386 8.56615 29.5965 8.93747 28.8922 9.12721C28.2721 9.29274 27.6213 9.30689 26.9947 9.16846C26.743 9.11512 26.482 9.12537 26.2354 9.19829C25.9887 9.27122 25.7641 9.40452 25.5819 9.58612L18.688 16.5007L16.5017 14.3144L23.3956 7.41534ZM9.6078 25.586C9.42702 25.7676 9.29421 25.9914 9.22131 26.2371C9.14841 26.4828 9.1377 26.7428 9.19014 26.9936C9.32353 27.6156 9.3094 28.2601 9.14889 28.8757C8.95963 29.5802 8.58846 30.2226 8.07262 30.7384C7.55677 31.2543 6.91437 31.6254 6.20983 31.8147C5.72143 31.9478 5.21181 31.9845 4.70936 31.923L6.14796 30.4535C6.43763 30.1634 6.60034 29.7703 6.60034 29.3603C6.60034 28.9504 6.43763 28.5573 6.14796 28.2672L4.68874 26.8132C4.54503 26.6689 4.37426 26.5545 4.18624 26.4764C3.99821 26.3984 3.79662 26.3582 3.59303 26.3582C3.38944 26.3582 3.18786 26.3984 2.99983 26.4764C2.8118 26.5545 2.64104 26.6689 2.49733 26.8132L1.05874 28.2982C1.00413 27.8004 1.0426 27.2968 1.17217 26.8132C1.36009 26.1032 1.73233 25.4555 2.25119 24.9357C2.77004 24.416 3.41707 24.0426 4.12671 23.8535C4.74713 23.6905 5.39728 23.6764 6.02421 23.8122C6.27586 23.8656 6.53684 23.8553 6.78353 23.7824C7.03022 23.7095 7.25482 23.5762 7.43702 23.3946L14.3155 16.5007L16.5017 18.6869L9.6078 25.586ZM20.8794 18.1764C20.9472 18.176 21.0145 18.189 21.0773 18.2147C21.1401 18.2404 21.1973 18.2782 21.2455 18.326L21.6115 18.6921L18.6931 21.6105L18.327 21.2444C18.231 21.1478 18.1771 21.0171 18.1771 20.8809C18.1771 20.7447 18.231 20.614 18.327 20.5174L20.5184 18.326C20.6145 18.2307 20.7441 18.177 20.8794 18.1764ZM3.21921 1.0319L4.12671 1.94456L1.94561 4.12565L1.03296 3.21815L3.21921 1.0319ZM3.73483 5.91487L2.30655 4.4969L4.49796 2.30549L5.91592 3.72862C5.98905 3.80003 6.0393 3.89156 6.0603 3.99159L6.3078 5.2394L5.24046 6.30674L3.99264 6.05924C3.89261 6.03825 3.80108 5.98799 3.72967 5.91487H3.73483ZM6.1428 6.86362L6.86983 6.13659L19.0798 18.326L18.327 19.0788L6.1428 6.86362ZM22.0653 19.7027L22.5036 21.4507L21.4723 22.4819L19.7244 22.0436L22.0653 19.7027ZM31.8209 29.6285L29.6295 31.8199C29.5329 31.9159 29.4022 31.9698 29.266 31.9698C29.1298 31.9698 28.9991 31.9159 28.9025 31.8199L21.6115 24.5238C21.5163 24.4277 21.4626 24.2981 21.462 24.1628C21.4616 24.095 21.4746 24.0277 21.5003 23.9649C21.526 23.9021 21.5638 23.8449 21.6115 23.7967L23.7978 21.6105C23.846 21.5627 23.9031 21.5249 23.9659 21.4992C24.0288 21.4736 24.096 21.4606 24.1639 21.461C24.2992 21.4615 24.4288 21.5152 24.5248 21.6105L31.8209 28.9014C31.8687 28.9496 31.9065 29.0068 31.9322 29.0696C31.9578 29.1324 31.9708 29.1997 31.9705 29.2675C31.9699 29.4028 31.9162 29.5324 31.8209 29.6285Z"
                      fill="#6E6E6E"
                    ></path>
                  </g>
                  <defs>
                    <clipPath id="clip0_60_2335">
                      <rect width="33" height="33" fill="white"></rect>
                    </clipPath>
                  </defs>
                </svg>
              </div>
              <h5 className="text-[16px] font-[600] text-[#232323]">
                Монтаж от профессионалов
              </h5>
            </div>
            <p className="text-[#232323] leading-[20px]">
              У нас вы можете заказать монтаж систем вентиляции,
              кондиционирования. Наши мастера имеют многолетний опыт.
            </p>
          </li>

          <li className="flex flex-col gap-4">
            <div className="flex gap-3 items-center">
              <div className="p-2 bg-gray-100 rounded-md">
                <svg
                  width="33"
                  height="33"
                  viewBox="0 0 33 33"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clipPath="url(#clip0_60_2342)">
                    <path
                      d="M32.8347 15.3727H31.2514V8.08945C31.2514 6.34335 29.8309 4.92285 28.0848 4.92285H25.9404L23.7459 0.977257C23.4115 0.374269 22.775 0 22.0847 0C21.7629 0 21.4438 0.0829737 21.1619 0.239363L12.74 4.92275H3.33262C1.58652 4.92275 0.166016 6.34325 0.166016 8.08935V29.8333C0.166016 31.5794 1.58652 32.9999 3.33262 32.9999H28.0848C29.8309 32.9999 31.2514 31.5794 31.2514 29.8333V23.4475H32.8347V15.3727ZM28.0848 6.18943C29.0601 6.18943 29.8568 6.93038 29.9638 7.87847H27.5838L26.6452 6.18943H28.0848ZM21.7781 1.3464C22.0751 1.17986 22.4748 1.29634 22.6388 1.59217L26.1347 7.87787H10.0319L21.7781 1.3464ZM29.9847 29.8333C29.9847 30.8808 29.1322 31.7333 28.0847 31.7333H3.33262C2.2851 31.7333 1.4326 30.8808 1.4326 29.8333V8.08945C1.4326 7.04193 2.2851 6.18943 3.33262 6.18943H10.4625L7.42513 7.87856H3.72847C3.37824 7.87856 3.09513 8.16227 3.09513 8.5119C3.09513 8.86154 3.37824 9.14524 3.72847 9.14524H5.1471H28.2881H29.9847V15.3733H25.3533C23.2025 15.3733 21.452 17.1238 21.452 19.2745V19.5469C21.452 21.6977 23.2026 23.4482 25.3533 23.4482H29.9847V29.8333ZM31.568 22.1809H31.2514H25.3533C23.9004 22.1809 22.7186 20.9992 22.7186 19.5462V19.2739C22.7186 17.821 23.9004 16.6392 25.3533 16.6392H31.2514H31.568V22.1809Z"
                      fill="#6E6E6E"
                    ></path>
                    <path
                      d="M25.8944 20.8604C26.667 20.8604 27.2928 20.2347 27.2928 19.4621C27.2928 18.69 26.6671 18.0636 25.8944 18.0637C25.1218 18.0637 24.4961 18.6895 24.4961 19.4621C24.4961 20.2346 25.1217 20.8604 25.8944 20.8604Z"
                      fill="#1B9AE9"
                    ></path>
                  </g>
                  <defs>
                    <clipPath id="clip0_60_2342">
                      <rect width="33" height="33" fill="white"></rect>
                    </clipPath>
                  </defs>
                </svg>
              </div>
              <h5 className="text-[16px] font-[600] text-[#232323]">
                Различные способы оплаты
              </h5>
            </div>
            <p className="text-[#232323] leading-[20px]">
              Мы принимаем оплату по карте, QR-коду, наличными, а также
              безналичный перевод для юридических лиц.
            </p>
          </li>
        </ul>

        {/* СПЕЦИАЛЬНЫЕ ПРЕДЛОЖЕНИЯ (КАРТОЧКА ТОВАРА): */}
        <section className="pt-4 px-3 xs:px-8 xl:px-14">
          <div>
            <h2 className="text-center pb-4  text-[22px]">
              Специальные предложения
            </h2>
            <div className="p-4 border-1 border-gray-300 rounded-2xl xs:flex">
              <div className="xs:pr-1 xs:border-r-1 xs:border-r-gray-300">
                <div className="flex align-center justify-between gap-1">
                  <p className=" text-[18px] font-[600]">Товар месяца!</p>
                  <CiStar className="text-[26px] text-[#6E6E6E] cursor-pointer" />
                </div>
                <div className="flex gap-2 pt-2">
                  <p className="h-6 flex items-center rounded-sm border-1 border-[#3BBA00] text-[11px] leading-1 text-[#3BBA00] px-1">
                    В наличии
                  </p>
                  <p className="uppercase flex items-center rounded-sm text-[11px] leading-1 px-2 bg-[#FF6341] text-[white]">
                    Хит
                  </p>
                </div>
                <div className="xs:w-fit">
                  <img className="max-h-[500px]" src={split_sys1}></img>
                </div>
              </div>
              <div className="flex flex-col xs:items-end xs:justify-between xs:pl-4 sm:justify-center lg:pr-4 lg:justify-start lg:gap-5 lg:items-start">
                <h4 className="font-[600] text-center mt-2 mb-2 xs:leading-[20px] xs:mt-0 sm:text-[18px]">
                  Сплит-система LESSAR COOL+ LS-H07KFE2/LU-H07KFE2
                </h4>
                <ul className="flex flex-col gap-2 sm:gap-6">
                  <li className="text-[12px] leading-[15px] text-[#6E6E6E] xs:text-[14px] sm:text-[16px] sm:leading-[20px]">
                    Тип внутреннего блока{' '}
                    <span className="text-[#6E6E6E] font-[700]">
                      (Настенный)
                    </span>
                  </li>
                  <li className="text-[12px] leading-[15px] text-[#6E6E6E] xs:text-[14px] sm:text-[16px] sm:leading-[20px]">
                    Производительность{' '}
                    <span className="text-[#6E6E6E] font-[700]">
                      (2,1 кВт / до 21м2)
                    </span>
                  </li>
                  <li className="text-[12px] leading-[15px] text-[#6E6E6E] xs:text-[14px] sm:text-[16px] sm:leading-[20px]">
                    Инверторная технология{' '}
                    <span className="text-[#6E6E6E] font-[700]">(Нет)</span>
                  </li>
                </ul>
                <div className="text-[20px] font-[600] mt-2 mb-2 sm:text-[24px] lg:text-[35px]">
                  30 500 ₽
                </div>
                <button className="flex items-center justify-center gap-2 p-2 bg-gradient-to-r from-blue-400 to-blue-500 rounded-md text-[whitesmoke] font-[500] cursor-pointer lg:w-[100%] lg:p-3 lg:text-[18px]">
                  В корзину <CiShoppingCart className="text-[25px]" />
                </button>
              </div>
              <div className="border-l-1 border-gray-300 flex-col justify-center gap-5 pl-4 hidden lg:flex">
                <div
                  className="h-[100px] w-[160px] flex items-center justify-center rounded-2xl font-[600]"
                  style={{ backgroundImage: `url(${bg1})` }}
                >
                  Фреон R32
                </div>
                <div
                  className="h-[100px] w-[160px] flex items-center justify-center rounded-2xl font-[600]"
                  style={{ backgroundImage: `url(${bg2})` }}
                >
                  Гарантия 10 лет
                </div>
              </div>
            </div>
          </div>
        </section>

        {/* НЕ МОЖЕТЕ ОПРЕДЕЛИТЬСЯ С ВЫБОРОМ? ПОЗВОНИТЕ НАМ: */}
        <section className="pt-4 px-3 xs:px-8 xl:px-14">
          <div className="flex flex-col items-center gap-4 pt-4 pb-8 bg-[#B4E2FF] rounded-2xl sm:flex-row">
            <div className="flex flex-col gap-3 px-4">
              <h3 className="text-[22px] text-[#6E6E6E]">
                Не можете определиться с выбором?
              </h3>
              <p className="text-[18px] font-[600] leading-[138%] text-[#232323]">
                Позвоните нам{' '}
                <span className="text-[#1b9ae9]">+7 (981) 755-47-56</span>,
                подберем для Вас самый оптимальный вариант!
              </p>

              <ul className="gap-3 mt-4 hidden lg:flex">
                <li className="w-[40px] h-[40px] flex items-center justify-center bg-[#1B9AE9] rounded-[50%]">
                  <svg
                    width="27"
                    height="16"
                    viewBox="0 0 27 16"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fillRule="evenodd"
                      clipRule="evenodd"
                      d="M13.2447 15.7716H14.8145C14.8145 15.7716 15.2887 15.7196 15.5307 15.4586C15.7536 15.219 15.7464 14.7691 15.7464 14.7691C15.7464 14.7691 15.7158 12.6628 16.6934 12.3526C17.657 12.0471 18.8945 14.3883 20.2061 15.2885C21.198 15.9699 21.9517 15.8205 21.9517 15.8205L25.4587 15.7716C25.4587 15.7716 27.2934 15.6586 26.4235 14.2161C26.3522 14.0981 25.9169 13.1491 23.8159 11.1989C21.6169 9.15784 21.9114 9.48798 24.5603 5.95737C26.1736 3.80721 26.8185 2.4945 26.6171 1.93227C26.4249 1.39678 25.2384 1.53832 25.2384 1.53832L21.2896 1.56292C21.2896 1.56292 20.9969 1.52299 20.7798 1.65276C20.5676 1.78004 20.4311 2.07666 20.4311 2.07666C20.4311 2.07666 19.8061 3.74054 18.9726 5.15556C17.2142 8.14141 16.5112 8.29899 16.2238 8.1136C15.5553 7.6815 15.7222 6.37771 15.7222 5.45147C15.7222 2.55797 16.1611 1.35151 14.8676 1.03919C14.4384 0.935448 14.1225 0.866996 13.0248 0.855944C11.6158 0.841327 10.4233 0.860222 9.74801 1.19107C9.2988 1.41104 8.95226 1.90126 9.16332 1.92942C9.42429 1.96436 10.0154 2.08879 10.3288 2.51554C10.7334 3.066 10.7192 4.30241 10.7192 4.30241C10.7192 4.30241 10.9516 7.70859 10.1762 8.13178C9.64391 8.42199 8.91376 7.82945 7.34614 5.12062C6.54291 3.73305 5.93647 2.19931 5.93647 2.19931C5.93647 2.19931 5.81953 1.91267 5.61097 1.75936C5.35784 1.57362 5.00417 1.51443 5.00417 1.51443L1.25181 1.53903C1.25181 1.53903 0.688508 1.55472 0.481727 1.79965C0.297764 2.01748 0.46711 2.46812 0.46711 2.46812C0.46711 2.46812 3.40483 9.34109 6.73115 12.8047C9.78117 15.9802 13.2447 15.7716 13.2447 15.7716Z"
                      fill="white"
                    ></path>
                  </svg>
                </li>
                <li className="w-[40px] h-[40px] flex items-center justify-center bg-[#39a150] rounded-[50%]">
                  <svg
                    width="22"
                    height="22"
                    viewBox="0 0 22 22"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M15.7886 13.0073L15.7808 13.0725C13.8686 12.1195 13.6686 11.9925 13.4217 12.3629C13.2504 12.6194 12.7513 13.2012 12.6008 13.3733C12.4487 13.5429 12.2974 13.5559 12.0391 13.4386C11.7782 13.3081 10.9409 13.0342 9.94958 12.1473C9.17742 11.456 8.65917 10.6082 8.50613 10.3473C8.25135 9.90732 8.78438 9.84472 9.26959 8.92648C9.35655 8.74387 9.3122 8.60039 9.24785 8.47083C9.18264 8.3404 8.66352 7.06216 8.44613 6.55261C8.23744 6.04479 8.02266 6.10914 7.86179 6.10914C7.36094 6.06566 6.99486 6.07262 6.67225 6.40826C5.2688 7.95084 5.62271 9.54211 6.82355 11.2343C9.18351 14.3229 10.4409 14.8916 12.74 15.6811C13.3608 15.8785 13.9269 15.8507 14.3747 15.7863C14.8738 15.7072 15.9112 15.1594 16.1277 14.5464C16.3494 13.9333 16.3494 13.4246 16.2842 13.3073C16.2199 13.1899 16.0495 13.1247 15.7886 13.0073Z"
                      fill="white"
                    ></path>
                    <path
                      d="M18.4085 3.56487C11.7226 -2.89847 0.657602 1.78926 0.653254 10.9073C0.653254 12.7299 1.13064 14.5073 2.04018 16.0768L0.56543 21.4349L6.07401 19.9985C12.9478 23.7114 21.4311 18.7811 21.4346 10.9126C21.4346 8.15087 20.3563 5.55179 18.3955 3.59879L18.4085 3.56487ZM19.6972 10.8839C19.692 17.5211 12.4061 21.6662 6.64357 18.2785L6.33053 18.0924L3.06973 18.9402L3.94362 15.7707L3.7358 15.4446C0.149786 9.73605 4.2697 2.27534 11.0626 2.27534C13.3704 2.27534 15.5364 3.17532 17.1677 4.80572C18.7981 6.42221 19.6972 8.58825 19.6972 10.8839Z"
                      fill="white"
                    ></path>
                  </svg>
                </li>
                <li className="w-[40px] h-[40px] flex items-center justify-center bg-[#1B9AE9] rounded-[50%]">
                  <svg
                    width="22"
                    height="20"
                    viewBox="0 0 22 20"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M1.06442 9.60754L5.87319 11.4972L7.73448 17.7993C7.85358 18.2029 8.32238 18.3521 8.63354 18.0843L11.314 15.7836C11.595 15.5426 11.9952 15.5306 12.2889 15.755L17.1235 19.4505C17.4564 19.7052 17.928 19.5132 18.0114 19.0897L21.5531 1.15375C21.6442 0.691166 21.2125 0.305261 20.7941 0.475619L1.05878 8.49114C0.571758 8.68889 0.576001 9.41485 1.06442 9.60754ZM7.43452 10.4913L16.8326 4.39714C17.0016 4.28794 17.1753 4.52839 17.0303 4.67003L9.2741 12.2607C9.00147 12.5279 8.82561 12.8854 8.7758 13.2735L8.51159 15.335C8.4766 15.6102 8.10937 15.6375 8.03723 15.3711L7.02109 11.6121C6.90471 11.1833 7.07431 10.7253 7.43452 10.4913Z"
                      fill="white"
                    ></path>
                  </svg>
                </li>
              </ul>
            </div>
            <div className="pl-6 ml-auto">
              <img
                className="w-[100%] rounded-l-[300px]"
                src={split_systems}
              ></img>
            </div>
          </div>
        </section>

        {/* О НАС: */}
        <section className="flex p-3 xs:px-8 xl:px-14">
          <div className="">
            <h3 className="pb-4 text-[22px]">О Нас</h3>
            <div className="flex gap-3">
              <div>
                <p>
                  Климатическая компания "СофтВент" – это надежный партнер для
                  тех, кто стремится создать комфортные условия для жизни и
                  работы в любых помещениях. Наша компания предлагает
                  высококачественные системы кондиционирования, вентиляции от
                  ведущих мировых производителей. Компания "СофтВент"
                  осуществляет полный комплекс услуг, начиная от проектирования
                  и монтажа климатических систем и заканчивая их обслуживанием.
                  Мы гарантируем высокое качество всех выполняемых работ и
                  строго соблюдаем установленные сроки.
                </p>
                <a
                  className="mt-4 h-[54px] w-[60%] flex items-center justify-center text-[16px] leading-[20px] font-[600] text-[#1B9AE9] border-1 border-blue-300 rounded-2xl"
                  href="#"
                >
                  Подробнее о нас
                </a>
              </div>
              <div className="lg:flex items-start hidden">
                <img className="rounded-2xl" src={big_screen_img1}></img>
              </div>
            </div>
          </div>
        </section>

        {/* ИНДИВИДУАЛЬНЫЕ УСЛОВИЯ (ДЛЯ ПРОЕКТИРОВЩИКОВ И ДИЗАЙНЕРОВ): */}
        <section className="flex flex-col gap-5 p-3 xs:px-8 xl:px-14 lg:flex-row">
          <div
            className="flex items-center justify-start gap-10 p-3 bg-cover bg-center rounded-2xl lg:p-10 lg:min-h-[400px] lg:gap-20"
            style={{ backgroundImage: `url(${project_img})` }}
          >
            <div className="w-[80%] flex flex-col justify-center p-3 bg-gray-200 opacity-90 rounded-2xl xs:w-[65%] lg:gap-5">
              <h2 className="text-left pb-2 text-[22px] leading-[27px] lg:text-center">
                Индивидуальные условия для проектировщиков и дизайнеров
              </h2>
              <p className="text-left text-[14px] leading-[130%] xs:text-[16px] sm:text-[18px] lg:text-center">
                Наша совместная работа может помочь в создании более эффективных
                и удобных климатических решений в любых помещениях.
              </p>
              <div className="text-[#1b9ae9] font-[600] lg:text-center">
                +7 (981) 755-47-56
              </div>
            </div>

            <div className="p-3 gap-3 bg-gray-200 opacity-90 rounded-2xl hidden xl:flex">
              <div className="flex flex-col justify-center gap-4">
                <button className="">Проектировщикам</button>
                <button className="">Монтажникам</button>
                <button className="">Маркетплейсам</button>
                <button className="">Клиентам</button>
              </div>
              <div>
                <ul className="flex flex-col gap-2">
                  <li className="">Оборудование от производителя.</li>
                  <li className="">Специальные условия.</li>
                  <li className="">Оборудование в наличии на складе.</li>
                  <li className="">Соблюдение сроков.</li>
                </ul>
              </div>
            </div>
          </div>

          {/* НАШИ ПАРТНЕРЫ: */}
          <div className="min-w-[300px] flex flex-col items-center justify-start">
            <h2 className="text-center pb-4 text-[22px]">Наши Партнеры</h2>
            <ul className="flex flex-col gap-3">
              <li className="flex gap-4 justify-center items-center lg:flex-col">
                <img className="h-[34px]" src={daikin_img}></img>
                <img className="h-[34px]" src={lessar_img}></img>
              </li>
              <li className="flex gap-4 justify-center items-center lg:flex-col">
                <img className="h-[34px]" src={lg_img}></img>
                <img className="h-[34px]" src={royalcli_img}></img>
              </li>
            </ul>
          </div>
        </section>
      </main>

      {/* --------------------------------------------------- FOOTER: -------------------------------------------------------------- */}
      {/* --------------------------------------------------- FOOTER: -------------------------------------------------------------- */}
      {/* --------------------------------------------------- FOOTER: -------------------------------------------------------------- */}
      <footer className="my-4 flex flex-col gap-3 px-3 xs:px-8 xl:px-14">
        <div className="flex flex-col gap-1">
          <div>
            <div className="flex justify-between">
              <p>Каталог</p>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth={1.5}
                stroke="currentColor"
                className="size-4"
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="m19.5 8.25-7.5 7.5-7.5-7.5"
                />
              </svg>
            </div>
            <ul>
              <li></li>
            </ul>
          </div>

          <div>
            <div className="flex justify-between">
              <p>Связаться с нами</p>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                fill="none"
                viewBox="0 0 24 24"
                strokeWidth={1.5}
                stroke="currentColor"
                className="size-4"
              >
                <path
                  strokeLinecap="round"
                  strokeLinejoin="round"
                  d="m19.5 8.25-7.5 7.5-7.5-7.5"
                />
              </svg>
            </div>
            <ul>
              <li></li>
            </ul>
          </div>
        </div>

        <div className="pt-3 flex flex-col gap-3 border-t-1 border-t-[rgba(114,114,114,0.2)] text-[12px] leading-[138%] text-[#232323] xs:text-[14px] sm:text-[16px]">
          <p>
            2025 © Интернет-магазин систем кондиционирования, вентиляции и
            отопления. Все права защищены.
          </p>
          <div className="flex gap-1">
            Разработка сайта -
            <span className="text-[#1b9ae9]">Бордюгов Виктор</span>
          </div>
        </div>

        <div className="flex items-center gap-3">
          <img className="max-w-[64px]" src={visa_img}></img>
          <img className="max-w-[64px]" src={mir_img}></img>
          <img className="max-w-[64px]" src={mastercard}></img>
        </div>
      </footer>

      {/* --------------------------------------------- НАВИГАЦИОННОЕ МЕНЮ (МОБИЛЬНЫЕ УСТРОЙСТВА): ---------------------------------------------- */}
      {/* --------------------------------------------- НАВИГАЦИОННОЕ МЕНЮ (МОБИЛЬНЫЕ УСТРОЙСТВА): ---------------------------------------------- */}
      {/* --------------------------------------------- НАВИГАЦИОННОЕ МЕНЮ (МОБИЛЬНЫЕ УСТРОЙСТВА): ---------------------------------------------- */}
      <nav className="p-2 nav-menu-shadow xs:px-8 xl:px-14 lg:hidden">
        <ul className="flex gap-1 justify-between md:justify-center md:gap-16">
          <li className="cursor-pointer">
            <a className="flex flex-col gap-1 items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
              <IoSearch className="text-[26px]" />
              <span>Поиск</span>
            </a>
          </li>
          <li className="cursor-pointer">
            <a className="flex flex-col gap-1 items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
              <HiOutlineViewGrid className="text-[26px]" />
              <span>Каталог</span>
            </a>
          </li>
          <li className="cursor-pointer">
            <a className="flex flex-col gap-1 items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
              <PiStarBold className="text-[26px]" />
              <span>Избранное</span>
            </a>
          </li>
          <li className="cursor-pointer">
            <a className="flex flex-col gap-1 items-center text-[12px] text-[#6E6E6E] xs:text-[14px]">
              <FiShoppingCart className="text-[26px]" />
              <span>Корзина</span>
            </a>
          </li>
        </ul>
      </nav>
    </>
  );
};

export default App;
